InformationRegisters/ЛБ_СогласияНаИнформирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СогласияНаИнформирование</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыСогласийНаИнформирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибочное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыСогласийНаИнформирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыСогласийНаИнформирование</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнуто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаключено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЛБ_СогласияНаИнформированиеКлиент/Ext/Module.bsl
Процедура ОбработкаКоманд(ИмяКоманды = "", Клиент = Неопределено, ОписаниеОповещения = Неопределено, 
	ПараметрыОтчетаОСогласияхНаИнформирование = Неопределено, Форма = Неопределено) Экспорт
	Если ИмяКоманды = "ЗаключитьСогласие" Тогда
		ДействующееСогласие = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Клиент);
		Если ДействующееСогласие = Ложь Тогда
			ЗаключитьСогласиеКлиент(Клиент, Форма, ОписаниеОповещения);
		Иначе
			Вопрос("У клиента уже есть действующее согласие на информирование.",
			РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
		КонецЕсли;
	ИначеЕсли ИмяКоманды = "ОтозватьСогласие" Тогда
		ДействующееСогласие = ЛБ_СогласияНаИнформированиеСервер.НаличиеДействующегоСогласия(Клиент);
		Если ДействующееСогласие = Истина Тогда
			Параметры = Новый Структура("Клиент", Клиент);
			
			ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаРасторженияСогласияНаИнформирование", Параметры
			,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			Вопрос("У клиента нет действующего согласия на информирование.",
			РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
		КонецЕсли;
	ИначеЕсли ИмяКоманды = "ОтозватьСогласиеПродолжить" Тогда
		ОтозватьСогласие(Клиент, Форма, ОписаниеОповещения);
	ИначеЕсли ИмяКоманды = "УдалитьСогласие" Тогда
			УдалитьСогласие(Клиент);
	ИначеЕсли ИмяКоманды = "ИсторияСогласия" Тогда
		Отбор = Новый Структура("Клиент", Клиент);  
		ОткрытьФорму("РегистрСведений.ЛБ_СогласияНаИнформирование.Форма.ФормаНабораЗаписей", 
		Новый Структура("Отбор", Отбор),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ИмяКоманды = "ПечатьСогласиеНаИнформирование" Тогда
		ПечатьСогласияИзФормы(Клиент, Форма);
	ИначеЕсли ИмяКоманды = "ПечатьОтзывСогласияНаИнформирование" Тогда
		ПечатьОтзываИзФормы(Клиент, Форма);
	ИначеЕсли ИмяКоманды = "ПечатьОтчетОСогласиях" Тогда
		ПечатьОтчетаОСогласияхНаИнформирование(ПараметрыОтчетаОСогласияхНаИнформирование, Форма);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаключитьСогласиеКлиент(Клиент, Форма, ОписаниеОповещенияЗакрытие)
	
	ОтветПечатьСогласия = Вопрос("Распечатать согласие на информирование?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	
	Если ОтветПечатьСогласия = КодВозвратаДиалога.Да Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Клиент", Клиент);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДополнительныеПараметры.Вставить("ОписаниеОповещенияЗакрытие", ОписаниеОповещенияЗакрытие);
		ОписаниеОповещенияПечатьСогласия = Новый ОписаниеОповещения("ПечатьСогласияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПечатьСогласия(Клиент, Форма, ОписаниеОповещенияПечатьСогласия);	
	КонецЕсли;
	
КонецПроцедуры // ЗаключитьЭДОКлиент()

Процедура ОтозватьСогласие(Клиент, Форма, ОписаниеОповещения) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Клиент", Клиент);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ПечатьОтзыва(Клиент, Форма, ОписаниеОповещения);
КонецПроцедуры

Процедура ОтменитьИзменениеКонтактныхДанных(Клиент, Период, Ответственный) Экспорт	
	Если Не ЛБ_СогласияНаИнформированиеСервер.ПроверкаРоли_ЛБ_СотрудникЦО() Тогда 
		Если (Период + 3600) > ТекущаяДата() Тогда
			Если Ответственный = ЛБ_СогласияНаИнформированиеСервер.ТекущийСотрудникСеанса() Тогда
				ЛБ_СогласияНаИнформированиеСервер.ОтменитьИзменениеКонтактныхДанныхСервер(Клиент, Период);
				Вопрос("Запись о подписании заявления об изменении контактных данных от " + Строка(Период) + " отменена.",
					РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
			Иначе
				Вопрос("Контактные данные были изменены другим пользователем, отмена запрещена.",
				РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
			КонецЕсли;
		Иначе
			Вопрос("С момента изменения контактных данных прошло более 1 часа, отмена запрещена.",
			РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
		КонецЕсли;
	Иначе	
		ЛБ_СогласияНаИнформированиеСервер.ОтменитьИзменениеКонтактныхДанныхСервер(Клиент, Период);
		Вопрос("Запись о подписании заявления об изменении контактных данных от " + Строка(Период) + " отменена.",
			РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьСогласие(Клиент)
	СтруктураСогласия = ЛБ_СогласияНаИнформированиеСервер.ПоследнийСтатусСогласия(Клиент);
	Если СтруктураСогласия.Количество() > 0 Тогда
	Если СтруктураСогласия.Статус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыСогласийНаИнформирование.Заключено") Тогда
		ОтветУдалить = Вопрос("Удалить ошибочное согласие на информирование?",
		РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		
		Если ОтветУдалить = КодВозвратаДиалога.Да Тогда
			Если Не ЛБ_СогласияНаИнформированиеСервер.ПроверкаРоли_ЛБ_СотрудникЦО() Тогда 
				Если (СтруктураСогласия.Период + 3600) > ТекущаяДата() Тогда
					Если СтруктураСогласия.Ответственный = ЛБ_СогласияНаИнформированиеСервер.ТекущийСотрудникСеанса() Тогда
						ЛБ_СогласияНаИнформированиеСервер.УдалитьЗаключениеСогласияСервер(Клиент, СтруктураСогласия);
					Иначе
						Вопрос("Согласие было заключено другим пользователем, удаление запрещено.",
						РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
					КонецЕсли;
				Иначе
					Вопрос("С момента заключения согласия прошло более 1 часа, удаление запрещено.",
					РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
				КонецЕсли;
			Иначе	
				ЛБ_СогласияНаИнформированиеСервер.УдалитьЗаключениеСогласияСервер(Клиент, СтруктураСогласия);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтруктураСогласия.Статус = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыСогласийНаИнформирование.Расторгнуто") Тогда
		ОтветУдалить = Вопрос("Удалить ошибочный отзыв согласия на информирование?",
		РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		
		Если ОтветУдалить = КодВозвратаДиалога.Да Тогда
			Если Не ЛБ_СогласияНаИнформированиеСервер.ПроверкаРоли_ЛБ_СотрудникЦО() Тогда 
				Если (СтруктураСогласия.Период + 3600) > ТекущаяДата() Тогда
					Если СтруктураСогласия.Ответственный = ЛБ_СогласияНаИнформированиеСервер.ТекущийСотрудникСеанса() Тогда
						ЛБ_СогласияНаИнформированиеСервер.УдалитьОтзывСогласияСервер(Клиент, СтруктураСогласия);
					Иначе
						Вопрос("Согласие было заключено другим пользователем, удаление запрещено.",
						РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
					КонецЕсли;
				Иначе
					Вопрос("С момента заключения согласия прошло более 1 часа, удаление запрещено.",
					РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
				КонецЕсли;
			Иначе	
				ЛБ_СогласияНаИнформированиеСервер.УдалитьОтзывСогласияСервер(Клиент, СтруктураСогласия);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Вопрос("У клиента нет действующего согласия/отзыва согласия на информирование.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);	
	КонецЕсли;	
	Иначе
		Вопрос("У клиента нет действующего согласия/отзыва согласия на информирование.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК); 
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьСогласия(Клиент, Форма, ОписаниеОповещенияПечатьСогласия)
	ТабличныйДокумент = ЛБ_СогласияНаИнформированиеСервер.ПечатьСогласиеНаИнформированиеСервер(Клиент);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СогласиеНаИнформирование");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Согласие на информирование"; 
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Форма, ОписаниеОповещенияПечатьСогласия);
КонецПроцедуры // ПечатьСоглашения()

Процедура ПечатьОтзыва(Клиент, Форма, ОписаниеОповещенияПечатьСогласия)
	ТабличныйДокумент = ЛБ_СогласияНаИнформированиеСервер.ПечатьОтзывСогласияНаИнформированиеСервер(Клиент);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтзывСогласияНаИнформирование");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Заявление об отзыве согласия на иформирование";
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Форма, ОписаниеОповещенияПечатьСогласия);
КонецПроцедуры // ПечатьСоглашения()

Процедура ПечатьСогласияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОтветСогласиеПодписано = Вопрос("Согласие на информирование подписано клиентом?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Если ОтветСогласиеПодписано = КодВозвратаДиалога.Да Тогда
		РезультатЗаключенияСогласия = ЛБ_СогласияНаИнформированиеСервер.ЗаключитьСогласиеНаИнформированиеСервер(ДополнительныеПараметры.Клиент);
		Если РезультатЗаключенияСогласия Тогда
			Вопрос("Факт заключения согласия на информирование зафиксирован.",
			РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
			ДополнительныеПараметры.Форма.Элементы.СтатусСогласия.Заголовок = "есть";
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияЗакрытие);
		КонецЕсли;
	Иначе 
		Вопрос("Согласие на информирование не заключено.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияЗакрытие);
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьОтзываЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОтветРасторжениеПодписано = Вопрос("Заявление на отзыв Согласия на информирование подписано клиентом?",
	РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
	Если ОтветРасторжениеПодписано = КодВозвратаДиалога.Да Тогда
		РезультатОтзываСогласия = ЛБ_СогласияНаИнформированиеСервер.ОтозватьСогласиеНаИнформирование(ДополнительныеПараметры.Клиент);
		Если РезультатОтзываСогласия Тогда
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьСогласияИзФормы(Клиент, Форма)
	Согласие = ЛБ_СогласияНаИнформированиеСервер.НаличиеСогласия(Клиент);
	Если Согласие = Истина Тогда	
    ТабличныйДокумент = ЛБ_СогласияНаИнформированиеСервер.ПечатьСогласиеНаИнформированиеСервер(Клиент, Истина);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_СогласиеНаИнформирование");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Согласие на информирование";
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,Форма);
	Иначе
		Вопрос("Клиент не заключал согласия на информирование.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьОтзываИзФормы(Клиент, Форма)
	Отзыв = ЛБ_СогласияНаИнформированиеСервер.НаличиеОтзыва(Клиент);
	Если Отзыв = Истина Тогда	
    ТабличныйДокумент = ЛБ_СогласияНаИнформированиеСервер.ПечатьОтзывСогласияНаИнформированиеСервер(Клиент, Истина);
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтзывСогласияНаИнформирование");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].СинонимМакета = "Заявление об отзыве согласия на иформирование";
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено, Форма);
	Иначе
		Вопрос("У клиента нет отозванного согласия на иформирование.",
		РежимДиалогаВопрос.ОК, 0, КодВозвратаДиалога.ОК);
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьОтчетаОСогласияхНаИнформирование(ПараметрыОтчетаОСогласияхНаИнформирование, Форма)
	
	ТабличныйДокумент = ЛБ_СогласияНаИнформированиеСервер.ПечатьОтчетОСогласияхНаИнформированиеСервер(ПараметрыОтчетаОСогласияхНаИнформирование);
	
	Если ТабличныйДокумент = Неопределено Тогда
		Предупреждение("Нет данных за выбранный период");
		Возврат;
	Иначе	
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛБ_ОтчетОСогласияхНаИнформирование");    
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет о согласиях на информирование";
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,Форма);
	КонецЕсли;
	
КонецПроцедуры
